tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "5";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar>
1875
(
119348.073
119348.087
119348.115
119348.156
119348.207
119348.266
119348.332
119348.403
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar>
25
(
119473.51
119473.524
119473.552
119473.593
119473.644
119473.703
119473.77
119473.84
...
)
;
    }
    outlet
    {
        type            calculated;
        value           uniform 100000;
    }
    wall1
    {
        type            calculated;
        value           nonuniform List<scalar>
75
(
119348.073
119096.454
118844.579
118592.451
118340.069
118087.434
117834.546
117581.406
...
)
;
    }
    wall2
    {
        type            calculated;
        value           nonuniform List<scalar>
75
(
119352.376
119100.503
118848.509
118596.324
118343.913
118091.264
117838.371
117585.229
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
